grevaillot/svd_tools/headers/STM32G471xx/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM3_BASE			(0x40000400)
#define TIM4_BASE			(0x40000800)
#define TIM5_BASE			(0x40000c00)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define CRS_BASE			(0x40002000)
#define TAMP_BASE			(0x40002400)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define SPI3_BASE			(0x40003c00)
#define USART2_BASE			(0x40004400)
#define USART3_BASE			(0x40004800)
#define UART4_BASE			(0x40004c00)
#define UART5_BASE			(0x40005000)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define USB_FS_device_BASE			(0x40005c00)
#define FDCAN1_BASE			(0x40006400)
#define FDCAN2_BASE			(0x40006800)
#define PWR_BASE			(0x40007000)
#define I2C3_BASE			(0x40007800)
#define LPTIMER1_BASE			(0x40007c00)
#define LPUART1_BASE			(0x40008000)
#define I2C4_BASE			(0x40008400)
#define UCPD1_BASE			(0x4000a000)
#define FDCAN_BASE			(0x4000a400)
#define SYSCFG_BASE			(0x40010000)
#define VREFBUF_BASE			(0x40010030)
#define COMP_BASE			(0x40010200)
#define OPAMP_BASE			(0x40010300)
#define EXTI_BASE			(0x40010400)
#define TIM1_BASE			(0x40012c00)
#define SPI1_BASE			(0x40013000)
#define TIM8_BASE			(0x40013400)
#define USART1_BASE			(0x40013800)
#define SPI4_BASE			(0x40013c00)
#define TIM15_BASE			(0x40014000)
#define TIM16_BASE			(0x40014400)
#define TIM17_BASE			(0x40014800)
#define SAI_BASE			(0x40015400)
#define DMA1_BASE			(0x40020000)
#define DMA2_BASE			(0x40020400)
#define DMAMUX_BASE			(0x40020800)
#define CORDIC_BASE			(0x40020c00)
#define RCC_BASE			(0x40021000)
#define FMAC_BASE			(0x40021400)
#define FLASH_BASE			(0x40022000)
#define CRC_BASE			(0x40023000)
#define GPIOA_BASE			(0x48000000)
#define GPIOB_BASE			(0x48000400)
#define GPIOC_BASE			(0x48000800)
#define GPIOD_BASE			(0x48000c00)
#define GPIOE_BASE			(0x48001000)
#define GPIOF_BASE			(0x48001400)
#define GPIOG_BASE			(0x48001800)
#define ADC1_BASE			(0x50000000)
#define ADC2_BASE			(0x50000100)
#define ADC12_Common_BASE			(0x50000300)
#define ADC3_BASE			(0x50000400)
#define ADC345_Common_BASE			(0x50000700)
#define DAC1_BASE			(0x50000800)
#define DAC2_BASE			(0x50000c00)
#define DAC3_BASE			(0x50001000)
#define DAC4_BASE			(0x50001400)
#define AES_BASE			(0x50060000)
#define RNG_BASE			(0x50060800)
#define SCB_ACTRL_BASE			(0xe000e008)
#define STK_BASE			(0xe000e010)
#define SCB_BASE			(0xe000e040)
#define MPU_BASE			(0xe000e084)
#define NVIC_BASE			(0xe000e100)
#define FPU_CPACR_BASE			(0xe000ef08)
#define FPU_BASE			(0xe000ef34)
#define DBGMCU_BASE			(0xe0042000)
